public class HomeWork3 {

/* Создать класс Massive со следующими методами:
-	метод printMassiveAsLine, который принимает в качестве аргументов массив и печатает его в консоли в одну строку,
ничего не возвращает;
-	метод printReverseMassiveAsLine, который принимает в качестве аргументов массив и печатает его в консоли в одну строку
в обратном порядке, ничего не возвращает;
-	метод getSumOfElements, который принимает массив, а возвращает сумму его элементов;
-	метод multiplyBy3, который принимает массив, умножает каждый элемент массива на 3 и возвращает умноженный массив;

    Пример вызова каждого из методов показать в методе main в другом классе в следующей последовательности:
 1.	Создать массив array с данными
2.	Создать объект класса Massive
3.	Используя методы класса Massive вывести созданный выше array в прямом и обратном порядке
4.	Используя методы класса Massive вывести сумму элементов array
5.	Используя методы класса Massive умножить созданный элемент array на 3
6.	Используя методы класса Massive вывести полученный после умножения array в прямом и обратном порядке
*/

}
